<?php

$config = [
    'sea' => [
        'size' => 10,
        'board' => [
            'empty' => '~',
            'miss' => '.',
            'hit' => 'X',
            'ship' => '@'
        ]
    ],
    'ships' => [
        ['size' => 4, 'name' => 'Авианосец'],
        ['size' => 3, 'name' => 'Линкор'],
        ['size' => 3, 'name' => 'Крейсер'],
        ['size' => 2, 'name' => 'Эсминец'],
        ['size' => 2, 'name' => 'Фрегат'],
        ['size' => 2, 'name' => 'Минный тральщик'],
        ['size' => 1, 'name' => 'Ракетный катер'],
        ['size' => 1, 'name' => 'Ракетный катер'],
        ['size' => 1, 'name' => 'Торпедный катер'],
        ['size' => 1, 'name' => 'Торпедный катер']
    ]
];


?>